{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "input_dtype": "float32", "nb_row": 5, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_1", "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "bias": true, "W_regularizer": null, "nb_filter": 192, "init": "glorot_uniform", "trainable": true, "nb_col": 5, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "nb_row": 5, "subsample": [1, 1], "W_constraint": null, "dim_ordering": "tf", "border_mode": "same", "name": "convolution2d_2", "activity_regularizer": null, "W_regularizer": null, "nb_filter": 192, "init": "glorot_uniform", "trainable": true, "nb_col": 5, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "name": "dense_1", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "output_dim": 1000, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "W_constraint": null, "name": "dense_2", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}}]}