{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "W_regularizer": null, "border_mode": "same", "batch_input_shape": [null, 32, 32, 3], "b_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 5, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_1", "input_dtype": "float32", "activity_regularizer": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "nb_row": 5, "nb_filter": 192}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "W_regularizer": null, "border_mode": "same", "b_regularizer": null, "b_constraint": null, "trainable": true, "nb_col": 5, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_2", "activity_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "nb_row": 5, "nb_filter": 192}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "output_dim": 1000, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "bias": true, "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "output_dim": 10, "b_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "bias": true, "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}}]}