{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 192, "name": "convolution2d_1", "trainable": true, "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "b_constraint": null, "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "input_dtype": "float32", "nb_col": 5, "bias": true, "W_constraint": null, "batch_input_shape": [null, 32, 32, 3], "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_filter": 192, "name": "convolution2d_2", "trainable": true, "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "b_constraint": null, "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "nb_col": 5, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "input_dim": null, "output_dim": 1000, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "input_dim": null, "output_dim": 10, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}}]}