{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "trainable": true, "batch_input_shape": [null, 32, 32, 3], "activation": "linear", "W_regularizer": null, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 192, "name": "convolution2d_1", "input_dtype": "float32", "activity_regularizer": null, "b_regularizer": null, "bias": true, "b_constraint": null, "subsample": [1, 1], "nb_col": 5, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "W_constraint": null, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "nb_filter": 192, "name": "convolution2d_2", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "subsample": [1, 1], "nb_col": 5}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "W_constraint": null, "activation": "linear", "bias": true, "output_dim": 1000, "name": "dense_1", "b_constraint": null, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "W_constraint": null, "activation": "linear", "bias": true, "output_dim": 10, "name": "dense_2", "b_constraint": null, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_4", "trainable": true}}]}