{"keras_version": "1.1.0", "config": [{"config": {"border_mode": "same", "name": "convolution2d_1", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "trainable": true, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "nb_filter": 192, "bias": true, "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"border_mode": "same", "name": "convolution2d_2", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "trainable": true, "W_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 192, "bias": true, "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "name": "dense_1", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "output_dim": 1000, "b_constraint": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "name": "dense_2", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "b_constraint": null, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}