{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "name": "convolution2d_1", "subsample": [1, 1], "border_mode": "same", "nb_row": 3, "dim_ordering": "tf", "input_dtype": "float32", "trainable": true, "W_regularizer": null, "nb_filter": 32, "batch_input_shape": [null, 32, 32, 3], "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "name": "convolution2d_2", "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_filter": 32, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "name": "convolution2d_3", "subsample": [1, 1], "border_mode": "same", "nb_row": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"bias": true, "b_constraint": null, "name": "convolution2d_4", "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 512, "activation": "linear", "W_regularizer": null, "name": "dense_1", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 10, "activation": "linear", "W_regularizer": null, "name": "dense_2", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "activity_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}], "keras_version": "1.1.0"}