{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "name": "convolution2d_1", "batch_input_shape": [null, 32, 32, 3], "nb_filter": 192, "subsample": [1, 1], "border_mode": "same", "trainable": true, "dim_ordering": "tf", "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_row": 5, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_filter": 192, "subsample": [1, 1], "border_mode": "same", "trainable": true, "dim_ordering": "tf", "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "nb_row": 5, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 1000, "trainable": true, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activation": "linear", "W_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 10, "trainable": true, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activation": "linear", "W_regularizer": null, "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}}], "keras_version": "1.1.0"}