{"keras_version": "1.1.0", "config": [{"config": {"border_mode": "same", "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_dtype": "float32", "subsample": [1, 1], "nb_row": 5, "name": "convolution2d_1", "nb_filter": 192, "bias": true, "batch_input_shape": [null, 32, 32, 3], "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "same", "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "subsample": [1, 1], "nb_row": 5, "name": "convolution2d_2", "nb_filter": 192, "bias": true, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "output_dim": 1000, "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "W_constraint": null, "bias": true, "name": "dense_1", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "input_dim": null, "trainable": true, "W_constraint": null, "bias": true, "name": "dense_2", "activation": "linear", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}