{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "same", "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "input_dtype": "float32", "b_regularizer": null, "nb_col": 5, "name": "convolution2d_1", "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_row": 5, "nb_filter": 192, "batch_input_shape": [null, 32, 32, 3], "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "nb_col": 5, "name": "convolution2d_2", "trainable": true, "activation": "linear", "init": "glorot_uniform", "nb_row": 5, "nb_filter": 192, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "trainable": true, "activation": "linear", "output_dim": 1000, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "bias": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "dense_2", "trainable": true, "activation": "linear", "output_dim": 10, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}}]}