{"keras_version": "1.1.0", "config": [{"config": {"W_regularizer": null, "b_constraint": null, "trainable": true, "nb_filter": 32, "batch_input_shape": [null, 32, 32, 3], "input_dtype": "float32", "activation": "linear", "b_regularizer": null, "W_constraint": null, "border_mode": "same", "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 3, "bias": true, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "trainable": true, "nb_filter": 32, "nb_row": 3, "activation": "linear", "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "b_constraint": null, "trainable": true, "nb_filter": 64, "nb_row": 3, "activation": "linear", "b_regularizer": null, "W_constraint": null, "border_mode": "same", "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "b_constraint": null, "trainable": true, "nb_filter": 64, "nb_row": 3, "activation": "linear", "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "nb_col": 3, "subsample": [1, 1], "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "output_dim": 512, "init": "glorot_uniform", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "output_dim": 10, "init": "glorot_uniform", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}], "class_name": "Sequential"}