{"config": {"layers": [{"config": {"sparse": false, "name": "input_1", "input_dtype": "float32", "batch_input_shape": [null, 3, 64, 64]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block1_conv1", "nb_row": 3, "b_regularizer": null, "nb_filter": 64, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block1_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block1_conv2", "nb_row": 3, "b_regularizer": null, "nb_filter": 64, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block1_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"config": {"dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "name": "block1_pool", "trainable": false, "pool_size": [2, 2]}, "name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block2_conv1", "nb_row": 3, "b_regularizer": null, "nb_filter": 128, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block2_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block2_conv2", "nb_row": 3, "b_regularizer": null, "nb_filter": 128, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block2_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"config": {"dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "name": "block2_pool", "trainable": false, "pool_size": [2, 2]}, "name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block3_conv1", "nb_row": 3, "b_regularizer": null, "nb_filter": 256, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block3_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block3_conv2", "nb_row": 3, "b_regularizer": null, "nb_filter": 256, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block3_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block3_conv3", "nb_row": 3, "b_regularizer": null, "nb_filter": 256, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block3_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"config": {"dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "name": "block3_pool", "trainable": false, "pool_size": [2, 2]}, "name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block4_conv1", "nb_row": 3, "b_regularizer": null, "nb_filter": 512, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block4_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block4_conv2", "nb_row": 3, "b_regularizer": null, "nb_filter": 512, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block4_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block4_conv3", "nb_row": 3, "b_regularizer": null, "nb_filter": 512, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block4_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"config": {"dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "name": "block4_pool", "trainable": false, "pool_size": [2, 2]}, "name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block5_conv1", "nb_row": 3, "b_regularizer": null, "nb_filter": 512, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block5_conv1", "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block5_conv2", "nb_row": 3, "b_regularizer": null, "nb_filter": 512, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block5_conv2", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"config": {"dim_ordering": "th", "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null, "W_constraint": null, "name": "block5_conv3", "nb_row": 3, "b_regularizer": null, "nb_filter": 512, "trainable": false, "subsample": [1, 1], "nb_col": 3, "W_regularizer": null}, "name": "block5_conv3", "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"config": {"dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "name": "block5_pool", "trainable": false, "pool_size": [2, 2]}, "name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]]}, {"config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0]]]}, {"config": {"init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "output_dim": 512, "trainable": true, "W_constraint": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"config": {"init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "softmax", "b_constraint": null, "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "input_dim": null, "output_dim": 200, "trainable": true, "W_constraint": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]]}], "name": "model_2", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "1.1.0", "class_name": "Model"}