{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "batch_input_shape": [null, 32, 32, 3], "bias": true, "init": "glorot_uniform", "nb_filter": 32, "name": "convolution2d_1", "subsample": [1, 1], "nb_col": 3, "border_mode": "same", "W_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3, "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "nb_filter": 32, "name": "convolution2d_2", "subsample": [1, 1], "nb_col": 3, "border_mode": "valid", "W_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "nb_filter": 64, "name": "convolution2d_3", "subsample": [1, 1], "nb_col": 3, "border_mode": "same", "W_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_constraint": null, "bias": true, "init": "glorot_uniform", "nb_filter": 64, "name": "convolution2d_4", "subsample": [1, 1], "nb_col": 3, "border_mode": "valid", "W_regularizer": null, "activation": "linear", "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "bias": true, "trainable": true, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 512}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "bias": true, "trainable": true, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 10}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "softmax"}}], "keras_version": "1.1.0"}