{"keras_version": "1.1.0", "config": {"name": "model_2", "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 3, 64, 64], "name": "input_1", "input_dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 64, "bias": true, "W_regularizer": null, "name": "block1_conv1", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "block1_conv2", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 64, "bias": true, "W_regularizer": null, "name": "block1_conv2", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"name": "block1_pool", "config": {"border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block1_pool", "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"name": "block2_conv1", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 128, "bias": true, "W_regularizer": null, "name": "block2_conv1", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"name": "block2_conv2", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 128, "bias": true, "W_regularizer": null, "name": "block2_conv2", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"name": "block2_pool", "config": {"border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block2_pool", "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"name": "block3_conv1", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 256, "bias": true, "W_regularizer": null, "name": "block3_conv1", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"name": "block3_conv2", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 256, "bias": true, "W_regularizer": null, "name": "block3_conv2", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"name": "block3_conv3", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 256, "bias": true, "W_regularizer": null, "name": "block3_conv3", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"name": "block3_pool", "config": {"border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block3_pool", "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"name": "block4_conv1", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 512, "bias": true, "W_regularizer": null, "name": "block4_conv1", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"name": "block4_conv2", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 512, "bias": true, "W_regularizer": null, "name": "block4_conv2", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"name": "block4_conv3", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 512, "bias": true, "W_regularizer": null, "name": "block4_conv3", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"name": "block4_pool", "config": {"border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block4_pool", "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"name": "block5_conv1", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 512, "bias": true, "W_regularizer": null, "name": "block5_conv1", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"name": "block5_conv2", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 512, "bias": true, "W_regularizer": null, "name": "block5_conv2", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"name": "block5_conv3", "config": {"border_mode": "same", "activation": "relu", "nb_filter": 512, "bias": true, "W_regularizer": null, "name": "block5_conv3", "activity_regularizer": null, "nb_col": 3, "dim_ordering": "th", "W_constraint": null, "init": "glorot_uniform", "trainable": false, "nb_row": 3, "subsample": [1, 1], "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"name": "block5_pool", "config": {"border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block5_pool", "pool_size": [2, 2], "dim_ordering": "th"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0]]]}, {"name": "dense_1", "config": {"activation": "relu", "output_dim": 512, "bias": true, "input_dim": null, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "dense_2", "config": {"activation": "softmax", "output_dim": 200, "bias": true, "input_dim": null, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]]}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}