{"class_name": "Model", "keras_version": "1.1.0", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 3, 64, 64], "name": "input_1"}}, {"class_name": "Convolution2D", "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block1_conv1", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 64, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block1_conv2", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"trainable": false, "dim_ordering": "th", "strides": [2, 2], "name": "block1_pool", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 128, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block2_conv1", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 128, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block2_conv2", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"trainable": false, "dim_ordering": "th", "strides": [2, 2], "name": "block2_pool", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 256, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block3_conv1", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 256, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block3_conv2", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 256, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block3_conv3", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"trainable": false, "dim_ordering": "th", "strides": [2, 2], "name": "block3_pool", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 512, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block4_conv1", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 512, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block4_conv2", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 512, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block4_conv3", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"trainable": false, "dim_ordering": "th", "strides": [2, 2], "name": "block4_pool", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 512, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block5_conv1", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 512, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block5_conv2", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "Convolution2D", "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0]]], "config": {"b_regularizer": null, "trainable": false, "nb_filter": 512, "W_constraint": null, "bias": true, "nb_row": 3, "b_constraint": null, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "activity_regularizer": null, "name": "block5_conv3", "activation": "relu", "W_regularizer": null, "nb_col": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0]]], "config": {"trainable": false, "dim_ordering": "th", "strides": [2, 2], "name": "block5_pool", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["block5_pool", 0, 0]]], "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_constraint": null, "input_dim": null, "output_dim": 512, "activity_regularizer": null, "name": "dense_1", "activation": "relu", "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"b_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_constraint": null, "input_dim": null, "output_dim": 200, "activity_regularizer": null, "name": "dense_2", "activation": "softmax", "W_regularizer": null, "init": "glorot_uniform"}}], "input_layers": [["input_1", 0, 0]]}}