{"keras_version": "1.1.0", "config": [{"config": {"nb_filter": 192, "b_regularizer": null, "trainable": true, "subsample": [1, 1], "name": "convolution2d_5", "bias": true, "nb_row": 5, "batch_input_shape": [null, 32, 32, 3], "dim_ordering": "tf", "b_constraint": null, "input_dtype": "float32", "activity_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "border_mode": "same", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_3", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_filter": 192, "b_regularizer": null, "trainable": true, "subsample": [1, 1], "name": "convolution2d_6", "bias": true, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "W_constraint": null, "W_regularizer": null, "border_mode": "same", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_4", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "name": "dense_3", "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 1000, "input_dim": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "name": "dense_4", "bias": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "trainable": true, "output_dim": 10, "input_dim": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}