{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_1", "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 64, "border_mode": "valid", "name": "conv1_1", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_2", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 64, "border_mode": "valid", "name": "conv1_2", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_3", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 128, "border_mode": "valid", "name": "conv2_1", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_4", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 128, "border_mode": "valid", "name": "conv2_2", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2], "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_5", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 256, "border_mode": "valid", "name": "conv3_1", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_6", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 256, "border_mode": "valid", "name": "conv3_2", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_7", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 256, "border_mode": "valid", "name": "conv3_3", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_8", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 256, "border_mode": "valid", "name": "conv3_4", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [2, 2], "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_9", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 512, "border_mode": "valid", "name": "conv4_1", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_10", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 512, "border_mode": "valid", "name": "conv4_2", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_11", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 512, "border_mode": "valid", "name": "conv4_3", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_12", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 512, "border_mode": "valid", "name": "conv4_4", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4", "strides": [2, 2], "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_13", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 512, "border_mode": "valid", "name": "conv5_1", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_14", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 512, "border_mode": "valid", "name": "conv5_2", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_15", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 512, "border_mode": "valid", "name": "conv5_3", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_16", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 512, "border_mode": "valid", "name": "conv5_4", "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_5", "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 1024, "b_constraint": null, "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 512, "b_constraint": null, "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 200, "b_constraint": null, "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "name": "dense_3", "b_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}], "keras_version": "1.1.0"}