{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "name": "convolution2d_1", "trainable": true, "nb_row": 3, "dim_ordering": "tf", "activity_regularizer": null, "activation": "linear", "W_constraint": null, "batch_input_shape": [null, 32, 32, 3], "b_constraint": null, "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "border_mode": "same"}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_1", "alpha": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "trainable": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_2", "alpha": 0.2, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "nb_filter": 64, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_3", "trainable": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_3", "alpha": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "trainable": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_4", "alpha": 0.2, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "nb_filter": 128, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_5", "trainable": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_5", "alpha": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "nb_col": 3, "nb_filter": 128, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_6", "trainable": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leakyrelu_6", "alpha": 0.2, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_1", "trainable": true, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 512, "b_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_2", "trainable": true, "W_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 10, "b_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "softmax", "trainable": true}}], "keras_version": "1.1.0"}