{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"input_dtype": "float32", "name": "zeropadding2d_1", "trainable": true, "padding": [1, 1], "batch_input_shape": [null, 3, 64, 64]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv1_1", "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_2", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv1_2", "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_3", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv2_1", "W_constraint": null, "nb_filter": 128, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_4", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv2_2", "W_constraint": null, "nb_filter": 128, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_5", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv3_1", "W_constraint": null, "nb_filter": 256, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_6", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv3_2", "W_constraint": null, "nb_filter": 256, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_7", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv3_3", "W_constraint": null, "nb_filter": 256, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_8", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv4_1", "W_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_9", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv4_2", "W_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_10", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv4_3", "W_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_4", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_11", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv5_1", "W_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_12", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv5_2", "W_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_13", "trainable": true, "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "border_mode": "valid", "b_regularizer": null, "name": "conv5_3", "W_constraint": null, "nb_filter": 512, "init": "glorot_uniform", "trainable": false, "W_regularizer": null, "nb_row": 3, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_5", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "output_dim": 1024, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "relu", "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "output_dim": 512, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "output_dim": 200, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "1.1.0"}