{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "input_dtype": "float32", "name": "zeropadding2d_1", "trainable": true, "batch_input_shape": [null, 3, 64, 64]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv1_1", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 64, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv1_2", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 64, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv2_1", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 128, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv2_2", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 128, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_5", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv3_1", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 256, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_6", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv3_2", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 256, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_7", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv3_3", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 256, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_8", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv4_1", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 512, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_9", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv4_2", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 512, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_10", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv4_3", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 512, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_11", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv5_1", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 512, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_12", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv5_2", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 512, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "name": "zeropadding2d_13", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "conv5_3", "activity_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 512, "dim_ordering": "th", "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "trainable": false, "nb_row": 3}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "dim_ordering": "th", "strides": [2, 2], "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "activation": "relu", "input_dim": null, "b_constraint": null, "output_dim": 1024, "bias": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "activation": "relu", "input_dim": null, "b_constraint": null, "output_dim": 512, "bias": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_3", "activity_regularizer": null, "activation": "linear", "input_dim": null, "b_constraint": null, "output_dim": 200, "bias": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "trainable": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}