{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "name": "convolution2d_1", "nb_filter": 32, "b_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "border_mode": "same", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "activation": "linear", "input_dtype": "float32"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "name": "leakyrelu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "name": "convolution2d_2", "nb_filter": 32, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "name": "leakyrelu_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "name": "convolution2d_3", "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "border_mode": "same", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "name": "leakyrelu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "name": "leakyrelu_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.3, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "name": "convolution2d_5", "nb_filter": 128, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "border_mode": "same", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "name": "leakyrelu_5", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "name": "convolution2d_6", "nb_filter": 128, "b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "nb_col": 3, "bias": true, "nb_row": 3, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "name": "leakyrelu_6", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.4, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "output_dim": 512, "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "b_constraint": null, "name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "output_dim": 10, "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "softmax"}}]}