{"keras_version": "1.1.0", "config": [{"config": {"dim_ordering": "tf", "activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1", "nb_filter": 192, "subsample": [1, 1], "border_mode": "same", "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "batch_input_shape": [null, 32, 32, 3], "W_constraint": null, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "nb_filter": 192, "subsample": [1, 1], "border_mode": "same", "nb_col": 5, "nb_row": 5, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "output_dim": 1000, "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "output_dim": 10, "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}