{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "activation": "linear", "bias": true, "activity_regularizer": null, "nb_filter": 192, "trainable": true, "nb_row": 5, "input_dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_1", "nb_col": 5, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "activation": "linear", "bias": true, "activity_regularizer": null, "nb_filter": 192, "trainable": true, "nb_row": 5, "nb_col": 5, "subsample": [1, 1], "W_regularizer": null, "name": "convolution2d_2", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 1000, "input_dim": null, "W_constraint": null, "name": "dense_1", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "trainable": true, "bias": true, "output_dim": 10, "input_dim": null, "W_constraint": null, "name": "dense_2", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_4"}}]}