{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"trainable": true, "batch_input_shape": [null, 64, 64, 3], "name": "zeropadding2d_1", "input_dtype": "float32", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv1_1", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 64, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_2", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv1_2", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 64, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_3", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv2_1", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 128, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_4", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv2_2", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 128, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_5", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv3_1", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 256, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_6", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv3_2", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 256, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_7", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv3_3", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 256, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_8", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv3_4", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 256, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_9", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv4_1", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 512, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_10", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv4_2", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 512, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_11", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv4_3", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 512, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_12", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv4_4", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 512, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_13", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv5_1", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 512, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_14", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv5_2", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 512, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_15", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv5_3", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 512, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_16", "padding": [1, 1]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "subsample": [1, 1], "nb_col": 3, "name": "conv5_4", "W_regularizer": null, "b_constraint": null, "bias": true, "dim_ordering": "tf", "nb_filter": 512, "trainable": true, "b_regularizer": null, "border_mode": "valid", "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_5", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "b_constraint": null, "name": "dense_1", "W_regularizer": null, "activation": "relu", "bias": true, "output_dim": 1024, "W_constraint": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "b_constraint": null, "name": "dense_2", "W_regularizer": null, "activation": "relu", "bias": true, "output_dim": 512, "W_constraint": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "b_constraint": null, "name": "dense_3", "W_regularizer": null, "activation": "linear", "bias": true, "output_dim": 200, "W_constraint": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}}], "keras_version": "1.1.0"}