{"config": [{"config": {"name": "convolution2d_1", "nb_row": 3, "b_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "init": "glorot_uniform", "nb_filter": 32, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "input_dtype": "float32", "border_mode": "same", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_2", "nb_row": 3, "b_regularizer": null, "trainable": true, "nb_filter": 32, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "activation": "linear", "activity_regularizer": null, "border_mode": "valid", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_3", "nb_row": 3, "b_regularizer": null, "trainable": true, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "activation": "linear", "activity_regularizer": null, "border_mode": "same", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "convolution2d_4", "nb_row": 3, "b_regularizer": null, "trainable": true, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "activation": "linear", "activity_regularizer": null, "border_mode": "valid", "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_regularizer": null, "output_dim": 512, "trainable": true, "W_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "b_regularizer": null, "output_dim": 10, "trainable": true, "W_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.0"}