{"keras_version": "1.1.0", "config": {"name": "model_2", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 3, 64, 64]}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block1_conv1", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "border_mode": "same"}}, {"inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block1_conv2", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 64, "border_mode": "same"}}, {"inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "trainable": false}}, {"inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block2_conv1", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 128, "border_mode": "same"}}, {"inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block2_conv2", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 128, "border_mode": "same"}}, {"inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "trainable": false}}, {"inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block3_conv1", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 256, "border_mode": "same"}}, {"inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block3_conv2", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 256, "border_mode": "same"}}, {"inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block3_conv3", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 256, "border_mode": "same"}}, {"inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "trainable": false}}, {"inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block4_conv1", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 512, "border_mode": "same"}}, {"inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block4_conv2", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 512, "border_mode": "same"}}, {"inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block4_conv3", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 512, "border_mode": "same"}}, {"inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "trainable": false}}, {"inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block5_conv1", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 512, "border_mode": "same"}}, {"inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block5_conv2", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 512, "border_mode": "same"}}, {"inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3", "class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "block5_conv3", "bias": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "trainable": false, "b_regularizer": null, "W_constraint": null, "activation": "relu", "nb_row": 3, "dim_ordering": "th", "activity_regularizer": null, "nb_col": 3, "nb_filter": 512, "border_mode": "same"}}, {"inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2], "trainable": false}}, {"inbound_nodes": [[["block5_pool", 0, 0]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_1", "output_dim": 512, "bias": true, "b_constraint": null, "W_regularizer": null, "input_dim": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "relu", "activity_regularizer": null}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2", "class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_2", "output_dim": 200, "bias": true, "b_constraint": null, "W_regularizer": null, "input_dim": null, "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model"}