{"keras_version": "1.1.0", "config": [{"config": {"dim_ordering": "tf", "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "batch_input_shape": [null, 32, 32, 3], "trainable": true, "border_mode": "same", "W_regularizer": null, "input_dtype": "float32", "bias": true, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "nb_filter": 32, "nb_row": 3, "b_regularizer": null, "name": "convolution2d_1", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "nb_filter": 32, "nb_row": 3, "b_regularizer": null, "name": "convolution2d_2", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "same", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "b_regularizer": null, "name": "convolution2d_3", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "nb_filter": 64, "nb_row": 3, "b_regularizer": null, "name": "convolution2d_4", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "input_dim": null, "output_dim": 512, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "name": "dense_1", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "input_dim": null, "output_dim": 10, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "name": "dense_2", "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}