{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "W_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "activation": "linear", "name": "convolution2d_1", "b_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "border_mode": "valid", "nb_col": 3, "nb_filter": 32, "b_regularizer": null, "activation": "linear", "name": "convolution2d_2", "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "b_regularizer": null, "activation": "linear", "name": "convolution2d_3", "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_regularizer": null, "nb_row": 3, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "border_mode": "valid", "nb_col": 3, "nb_filter": 64, "b_regularizer": null, "activation": "linear", "name": "convolution2d_4", "b_constraint": null, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_2", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 512, "trainable": true, "b_regularizer": null, "activation": "linear", "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 10, "trainable": true, "b_regularizer": null, "activation": "linear", "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_6", "trainable": true}}]}