{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "batch_input_shape": [null, 32, 32, 3], "init": "glorot_uniform", "name": "convolution2d_1", "nb_row": 3, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "trainable": true, "subsample": [1, 1], "nb_col": 3, "input_dtype": "float32", "nb_filter": 32, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "name": "convolution2d_2", "nb_row": 3, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "nb_filter": 32, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "name": "convolution2d_3", "nb_row": 3, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "same", "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "nb_filter": 64, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "name": "convolution2d_4", "nb_row": 3, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "W_regularizer": null, "W_constraint": null, "subsample": [1, 1], "nb_col": 3, "nb_filter": 64, "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "name": "dense_1", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "output_dim": 512, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "name": "dense_2", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "input_dim": null, "output_dim": 10, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "softmax"}}], "keras_version": "1.1.0"}