{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "input_dtype": "float32", "activity_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "b_constraint": null, "trainable": true, "dim_ordering": "tf", "nb_filter": 32, "activation": "linear", "bias": true, "border_mode": "same", "subsample": [1, 1], "batch_input_shape": [null, 32, 32, 3], "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "W_constraint": null, "name": "convolution2d_2", "b_constraint": null, "trainable": true, "activation": "linear", "nb_filter": 32, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "W_constraint": null, "name": "convolution2d_3", "b_constraint": null, "trainable": true, "activation": "linear", "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "W_constraint": null, "name": "convolution2d_4", "b_constraint": null, "trainable": true, "activation": "linear", "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_1", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 512}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_2", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 10}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}]}