{"keras_version": "1.1.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "W_constraint": null, "batch_input_shape": [null, 32, 32, 3], "nb_filter": 32, "input_dtype": "float32", "bias": true, "border_mode": "same", "activity_regularizer": null, "name": "convolution2d_1", "activation": "linear", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "W_constraint": null, "nb_filter": 32, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "bias": true, "name": "convolution2d_2", "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "W_constraint": null, "nb_filter": 64, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "bias": true, "name": "convolution2d_3", "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "W_constraint": null, "nb_filter": 64, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "bias": true, "name": "convolution2d_4", "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "name": "dense_1", "activation": "linear", "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "name": "dense_2", "activation": "linear", "input_dim": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "softmax", "trainable": true}}]}