{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_1", "W_constraint": null, "b_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_col": 3, "batch_input_shape": [null, 32, 32, 3], "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 32}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_col": 3, "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 32}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_col": 3, "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "border_mode": "same", "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_4", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "nb_col": 3, "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "output_dim": 512, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "input_dim": null, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "output_dim": 10, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "input_dim": null, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "softmax"}}]}