{"config": [{"config": {"input_dtype": "float32", "bias": true, "name": "convolution2d_1", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "border_mode": "same", "nb_filter": 32, "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "batch_input_shape": [null, 32, 32, 3], "nb_row": 3, "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "leakyrelu_1", "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"bias": true, "name": "convolution2d_2", "W_regularizer": null, "nb_filter": 32, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "leakyrelu_2", "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "convolution2d_3", "W_regularizer": null, "nb_filter": 64, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "leakyrelu_3", "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"bias": true, "name": "convolution2d_4", "W_regularizer": null, "nb_filter": 64, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "leakyrelu_4", "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.3, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias": true, "name": "convolution2d_5", "W_regularizer": null, "nb_filter": 128, "b_regularizer": null, "border_mode": "same", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "leakyrelu_5", "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"bias": true, "name": "convolution2d_6", "W_regularizer": null, "nb_filter": 128, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "activation": "linear", "nb_row": 3, "nb_col": 3, "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "leakyrelu_6", "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 512, "bias": true, "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "input_dim": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"output_dim": 10, "bias": true, "name": "dense_2", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "input_dim": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_2"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.0"}