{"config": [{"config": {"input_dtype": "float32", "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "nb_row": 3, "name": "convolution2d_1", "batch_input_shape": [null, 32, 32, 3], "nb_filter": 32, "subsample": [1, 1], "trainable": true, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "leakyrelu_1", "trainable": true, "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_2", "nb_filter": 32, "subsample": [1, 1], "trainable": true, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "leakyrelu_2", "trainable": true, "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_3", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "leakyrelu_3", "trainable": true, "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "leakyrelu_4", "trainable": true, "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.3, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_5", "nb_filter": 128, "subsample": [1, 1], "trainable": true, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "leakyrelu_5", "trainable": true, "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "nb_row": 3, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_6", "nb_filter": 128, "subsample": [1, 1], "trainable": true, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "leakyrelu_6", "trainable": true, "alpha": 0.2}, "class_name": "LeakyReLU"}, {"config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.4, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "output_dim": 512, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_1", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "output_dim": 10, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "name": "dense_2", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.0"}